# SQL
* Structured query language (SQL) is a standard language for database creation and manipulation. MySQL is a relational database program that uses SQL queries. While SQL commands are defined by international standards, the MySQL software

In [1]:
import sqlite3

# Creating a database and connecting it

In [2]:
con = sqlite3.connect('python800.db')

# Python and sql are different language . For the mediator we reqire cursor
* Cursor executes sql qurey.

In [3]:
cur = con.cursor()

# Creating table in sql
```sql
create table table_name (column_name_1 datatype, column_name_2 datatype.....)
```

In [4]:
query = '''
create table student(roll_no int, name varchar(50),address varchar(20)) 
'''

In [8]:
try:
    cur.execute(query)
except Exception as e:
    print(e)

table student already exists

# Inserting data into table
```sql
Insert into table_name(column_1, column_2,....)
values
(value_01,value_02,...),
(value_11,value_12,...)

```

In [9]:
query = '''
Insert into student(roll_no,name,address)
values
(1,'Smriti','Thecho'),
(2,'Anil','Dang'),
(3,'Anjali','Sarlahi'),
(4,'Bhawesh','Bhaktapur')
'''

In [10]:
cur.execute(query)

# Read data/Select statement from sql
syntax:
```sql
select * from table_name
```
```sql
select column_name_1, column_name_2,... from table_name
```

In [12]:
query = "select * from student"
cur.execute(query).fetchall()

[(1, 'Smriti', 'Thecho'),
 (2, 'Anil', 'Dang'),
 (3, 'Anjali', 'Sarlahi'),
 (4, 'Bhawesh', 'Bhaktapur')]

# Table bata data read garda fetch garnu parxa ani matra data auxa

In [15]:
cur.execute("select address from student").fetchall()

[('Thecho',), ('Dang',), ('Sarlahi',), ('Bhaktapur',)]

In [16]:
cur.execute("select roll_no from student").fetchall()

[(1,), (2,), (3,), (4,)]

# if is replaced by where in sql

# where clause/conditional

In [20]:
cur.execute("select * from student where roll_no = 2").fetchall()

[(2, 'Anil', 'Dang')]

In [21]:
query = '''
select name from student 
where
roll_no =1
'''

In [22]:
cur.execute(query).fetchall()

[('Smriti',)]

# What is the roll_no of Anil

In [23]:
cur.execute("select roll_no from student where name ='Anil'").fetchall() # value is case sensitive anil and Anil are different

[(2,)]

# Update database
```sql
update table_name 
set column_name_n = value
where 
condition
```

In [24]:
query = """
update student
set name = 'Smriti KC'
where 
roll_no = 1
"""

In [25]:
cur.execute(query)

In [26]:
cur.execute("select * from student").fetchall()

[(1, 'Smriti KC', 'Thecho'),
 (2, 'Anil', 'Dang'),
 (3, 'Anjali', 'Sarlahi'),
 (4, 'Bhawesh', 'Bhaktapur')]

# Delete statement in sql

In [27]:
cur.execute ("delete from student where roll_no = 4")

In [28]:
cur.execute("select * from student ").fetchall()

[(1, 'Smriti KC', 'Thecho'), (2, 'Anil', 'Dang'), (3, 'Anjali', 'Sarlahi')]

# CRUID OPERATIONS